---
kind: type
id: T:Autodesk.Revit.DB.ExternalService.IExternalData
source: html/d4f0854f-3b67-c60e-1696-8cffbaba065a.htm
---
# Autodesk.Revit.DB.ExternalService.IExternalData

The base interface for data classes used when executing servers of external services.

## Syntax (C#)
```csharp
public interface IExternalData
```

## Remarks
Each and every external service defines a concrete class derived from this interface
 and adds data and methods as it sees fit for executions of such a particular service.